In [ ]:
#LG Notes for reference
#4.1.05 -> unique/array
#4.1.07 -> column rename
#4.1.11 -> unique for adding up
    #author_count = len(goodreads_df["Authors"].unique())

#4.2.01 -> loc
    # Grab the data contained within the "Berry" row and the "Phone Number" column
    #berry_phone = df.loc["Berry", "Phone Number"]
    #print("Using Loc: " + berry_phone)
#4.2.03 -> cleaning data
#4.3.06 -> clean data & loc

In [ ]:
#clean data by age group desired, city, and year
#age group = 25-39
#cities: all for now
#year = 2015

In [3]:
#dependencies

import pandas as pd

In [4]:
#Use Pandas to read data
age_data = pd.read_csv("../Resources/Age_Data.csv")

In [5]:
#print to view
age_data.head()

   Unnamed: 0  Year        City        Age Range  Number in Range
0           0  2018  Albany, NY   18 to 24 Years            21091
1           1  2018  Albany, NY  75 Years & Over             5906
2           2  2018  Albany, NY   45 to 54 Years            10514
3           3  2018  Albany, NY    Under 5 Years             5491
4           4  2018  Albany, NY   65 to 74 Years             6670

In [6]:
#look for missing values
#awesome to see!
age_data.count()

Unnamed: 0         16236
Year               16236
City               16236
Age Range          16236
Number in Range    16236
dtype: int64

In [7]:
#sort by year
age_data.sort_values(by=["Year"])

,Unnamed: 0,Year,City,Age Range,Number in Range
8117,8117,2013,"Los Angeles, CA",Under 5 Years,249942
6991,6991,2013,"Indianapolis city (balance), IN",60 & 61 Years,18161
6990,6990,2013,"Indianapolis city (balance), IN",25 to 34 Years,139215
6989,6989,2013,"Indianapolis city (balance), IN",35 to 44 Years,108946
6988,6988,2013,"Indianapolis city (balance), IN",62 to 64 Years,23520
...,...,...,...,...,...
6602,6602,2018,"Houston, TX",45 to 54 Years,273635
6601,6601,2018,"Houston, TX",75 Years & Over,100271
6600,6600,2018,"Houston, TX",18 to 24 Years,230538
6609,6609,2018,"Houston, TX",25 to 34 Years,428263
0,0,2018,"Albany, NY",18 to 24 Years,21091

In [8]:
#get a list of all of our columns for easy reference
age_data.columns

Index(['Unnamed: 0', 'Year', 'City', 'Age Range', 'Number in Range'], dtype='object')

In [9]:
#collect data that includes year 2015 & age of 25-34
#'Year' = 2015
#'Age Range' = 25 t0 34 Years

age_data_2015_df = age_data.loc[(age_data["Year"] == 2015) & (age_data["Age Range"] == "25 to 34 Years")]

In [10]:
#print
age_data_2015_df.head()

     Unnamed: 0  Year        City       Age Range  Number in Range
33           33  2015  Albany, NY  25 to 34 Years            16221
99           99  2015  Albany, NY  25 to 34 Years            16221
165         165  2015  Albany, NY  25 to 34 Years            16221
231         231  2015  Albany, NY  25 to 34 Years            16221
297         297  2015  Albany, NY  25 to 34 Years            16221

In [11]:
#drop column "Unnamed: 0"
#add at end inplace=True -> to allow panda to edit the original DF
age_data_2015_df.drop(columns=["Unnamed: 0"], inplace=True)

In [12]:
#drop duplicates!
#missed the first time
#use city as subset - since it varies
#add at end inplace=True -> to allow panda to edit the original DF
#inplace=False -> does not affect the original DF
age_data_2015_df.drop_duplicates(subset="City", keep="first", inplace=True)

In [14]:
#print
age_data_2015_df

       Year                             City       Age Range  Number in Range
33     2015                       Albany, NY  25 to 34 Years            16221
429    2015                      Atlanta, GA  25 to 34 Years            97769
1221   2015                   Boise City, ID  25 to 34 Years            32674
1617   2015                       Boston, MA  25 to 34 Years           160732
2013   2015                      Buffalo, NY  25 to 34 Years            45033
2409   2015                    Charlotte, NC  25 to 34 Years           145380
2805   2015                      Chicago, IL  25 to 34 Years           530744
3201   2015                   Cincinnati, OH  25 to 34 Years            55956
3597   2015                     Columbus, OH  25 to 34 Years           174071
3993   2015                       Dallas, TX  25 to 34 Years           237015
4389   2015                       Denver, CO  25 to 34 Years           152706
4785   2015                      Detroit, MI  25 to 34 Years            95152
5181   2015                 Grand Rapids, MI  25 to 34 Years            35422
5577   2015                   Harrisburg, PA  25 to 34 Years             8005
5973   2015                     Hartford, CT  25 to 34 Years            19859
6369   2015                      Houston, TX  25 to 34 Years           417068
6765   2015  Indianapolis city (balance), IN  25 to 34 Years           140893
7161   2015                 Jacksonville, FL  25 to 34 Years           140159
7557   2015                    Las Vegas, NV  25 to 34 Years            87920
7953   2015                  Los Angeles, CA  25 to 34 Years           704854
8349   2015                        Miami, FL  25 to 34 Years            74621
8745   2015                    Nashville, NC  25 to 34 Years              537
9141   2015                  New Orleans, LA  25 to 34 Years            72223
9537   2015                     New York, NY  25 to 34 Years          1526724
9933   2015                      Orlando, FL  25 to 34 Years            63965
10329  2015                 Philadelphia, PA  25 to 34 Years           290196
10725  2015                      Phoenix, AZ  25 to 34 Years           244164
11121  2015                   Pittsburgh, PA  25 to 34 Years            62755
11517  2015                     Portland, OR  25 to 34 Years           125143
11913  2015                      Raleigh, NC  25 to 34 Years            81670
12309  2015                     Richmond, VA  25 to 34 Years            42797
12705  2015                      Roanoke, VA  25 to 34 Years            15171
13101  2015                   Sacramento, CA  25 to 34 Years            88813
13497  2015                    San Diego, CA  25 to 34 Years           262399
13893  2015                San Francisco, CA  25 to 34 Years           200061
14289  2015                      Seattle, WA  25 to 34 Years           157858
14685  2015                      Spokane, WA  25 to 34 Years            33577
15081  2015                    St. Louis, MO  25 to 34 Years            61677
15477  2015                     Syracuse, NY  25 to 34 Years            22863
15873  2015                        Tampa, FL  25 to 34 Years            61534

In [15]:
#export DF into a .csv
age_data_2015_df.to_csv("2015_all_cities_age_data.csv")